rssda-steady-state.log
sequential-fill: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=16
random-write-steady: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
random-read-steady: (g=2): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.8
Starting 9 processes

sequential-fill: (groupid=0, jobs=1): err= 0: pid=42227: Thu Jul 27 21:20:50 2017
  Description  : [Sequential fill phase]
  write: io=333861MB, bw=1213.6MB/s, iops=1213, runt=275120msec
    slat (usec): min=33, max=416, avg=97.58, stdev=32.62
    clat (msec): min=1, max=114, avg=13.09, stdev= 4.43
     lat (msec): min=1, max=114, avg=13.18, stdev= 4.43
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   13], 50.00th=[   13], 60.00th=[   13],
     | 70.00th=[   13], 80.00th=[   13], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   14], 99.50th=[   15], 99.90th=[  103], 99.95th=[  108],
     | 99.99th=[  112]
    bw (MB  /s): min= 1012, max= 1238, per=100.00%, avg=1214.84, stdev=63.78
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.73%, 50=0.01%
    lat (msec) : 100=0.11%, 250=0.14%
  cpu          : usr=2.54%, sys=9.91%, ctx=333887, majf=0, minf=2690
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=333861/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-write-steady: (groupid=1, jobs=4): err= 0: pid=42698: Thu Jul 27 21:20:50 2017
  Description  : [Random write steady state phase]
  write: io=1304.2GB, bw=582613KB/s, iops=145653, runt=2347175msec
    slat (usec): min=1, max=714, avg= 5.06, stdev= 4.03
    clat (usec): min=155, max=103827, avg=870.39, stdev=1341.06
     lat (usec): min=279, max=103830, avg=875.58, stdev=1341.02
    clat percentiles (usec):
     |  1.00th=[  410],  5.00th=[  438], 10.00th=[  486], 20.00th=[  564],
     | 30.00th=[  644], 40.00th=[  724], 50.00th=[  804], 60.00th=[  884],
     | 70.00th=[  972], 80.00th=[ 1096], 90.00th=[ 1272], 95.00th=[ 1448],
     | 99.00th=[ 1864], 99.50th=[ 2040], 99.90th=[ 2576], 99.95th=[ 2992],
     | 99.99th=[100864]
    bw (KB  /s): min=67771, max=297648, per=25.06%, avg=146027.40, stdev=30735.10
    lat (usec) : 250=0.01%, 500=11.35%, 750=31.60%, 1000=29.39%
    lat (msec) : 2=27.08%, 4=0.56%, 10=0.01%, 20=0.01%, 100=0.01%
    lat (msec) : 250=0.02%
  cpu          : usr=9.12%, sys=21.76%, ctx=168602650, majf=0, minf=47980
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=341873784/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
random-read-steady: (groupid=2, jobs=4): err= 0: pid=46802: Thu Jul 27 21:20:50 2017
  Description  : [Random read steady state phase]
  read : io=1304.2GB, bw=1477.2MB/s, iops=378140, runt=904091msec
    slat (usec): min=1, max=546, avg= 3.01, stdev= 3.92
    clat (usec): min=55, max=102557, avg=320.29, stdev=807.88
     lat (usec): min=69, max=102559, avg=323.40, stdev=808.04
    clat percentiles (usec):
     |  1.00th=[  139],  5.00th=[  175], 10.00th=[  199], 20.00th=[  235],
     | 30.00th=[  251], 40.00th=[  262], 50.00th=[  274], 60.00th=[  302],
     | 70.00th=[  330], 80.00th=[  362], 90.00th=[  442], 95.00th=[  564],
     | 99.00th=[  940], 99.50th=[ 1064], 99.90th=[ 1400], 99.95th=[ 1576],
     | 99.99th=[ 2192]
    bw (KB  /s): min=112168, max=836696, per=26.12%, avg=395038.32, stdev=92096.76
    lat (usec) : 100=0.05%, 250=29.57%, 500=63.24%, 750=4.74%, 1000=1.68%
    lat (msec) : 2=0.70%, 4=0.01%, 10=0.01%, 20=0.01%, 100=0.01%
    lat (msec) : 250=0.01%
  cpu          : usr=15.72%, sys=35.46%, ctx=40558084, majf=0, minf=37308
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=341873784/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=333861MB, aggrb=1213.6MB/s, minb=1213.6MB/s, maxb=1213.6MB/s, mint=275120msec, maxt=275120msec

Run status group 1 (all jobs):
  WRITE: io=1304.2GB, aggrb=582613KB/s, minb=582613KB/s, maxb=582613KB/s, mint=2347175msec, maxt=2347175msec

Run status group 2 (all jobs):
   READ: io=1304.2GB, aggrb=1477.2MB/s, minb=1477.2MB/s, maxb=1477.2MB/s, mint=904091msec, maxt=904091msec

Disk stats (read/write):
  rssda: ios=341907795/342541506, merge=0/0, ticks=99330658/303938087, in_queue=411881095, util=100.00%