rssdb-steady-state.log
sequential-fill: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=16
random-write-steady: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
random-read-steady: (g=2): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.8
Starting 9 processes

sequential-fill: (groupid=0, jobs=1): err= 0: pid=308: Thu Jul 27 22:27:04 2017
  Description  : [Sequential fill phase]
  write: io=333861MB, bw=1205.6MB/s, iops=1205, runt=276937msec
    slat (usec): min=34, max=528, avg=107.55, stdev=49.77
    clat (msec): min=1, max=114, avg=13.16, stdev= 4.47
     lat (msec): min=1, max=114, avg=13.27, stdev= 4.47
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   13], 50.00th=[   13], 60.00th=[   13],
     | 70.00th=[   13], 80.00th=[   13], 90.00th=[   13], 95.00th=[   14],
     | 99.00th=[   14], 99.50th=[   15], 99.90th=[  103], 99.95th=[  106],
     | 99.99th=[  110]
    bw (MB  /s): min=  998, max= 1230, per=100.00%, avg=1207.09, stdev=63.64
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.73%, 50=0.01%
    lat (msec) : 100=0.07%, 250=0.18%
  cpu          : usr=2.44%, sys=11.14%, ctx=333830, majf=0, minf=3221
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=333861/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-write-steady: (groupid=1, jobs=4): err= 0: pid=911: Thu Jul 27 22:27:04 2017
  Description  : [Random write steady state phase]
  write: io=1304.2GB, bw=587137KB/s, iops=146784, runt=2329089msec
    slat (usec): min=2, max=3841, avg= 5.15, stdev= 4.12
    clat (usec): min=156, max=106127, avg=863.48, stdev=1333.91
     lat (usec): min=281, max=106130, avg=868.76, stdev=1333.88
    clat percentiles (usec):
     |  1.00th=[  410],  5.00th=[  438], 10.00th=[  486], 20.00th=[  564],
     | 30.00th=[  644], 40.00th=[  724], 50.00th=[  796], 60.00th=[  876],
     | 70.00th=[  964], 80.00th=[ 1080], 90.00th=[ 1256], 95.00th=[ 1432],
     | 99.00th=[ 1848], 99.50th=[ 2024], 99.90th=[ 2512], 99.95th=[ 2928],
     | 99.99th=[100864]
    bw (KB  /s): min=76616, max=299768, per=25.06%, avg=147148.80, stdev=30766.33
    lat (usec) : 250=0.01%, 500=11.40%, 750=32.28%, 1000=29.52%
    lat (msec) : 2=26.24%, 4=0.53%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.02%
  cpu          : usr=9.17%, sys=22.25%, ctx=167281304, majf=0, minf=11319
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=341873784/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
random-read-steady: (groupid=2, jobs=4): err= 0: pid=5393: Thu Jul 27 22:27:04 2017
  Description  : [Random read steady state phase]
  read : io=1304.2GB, bw=1503.9MB/s, iops=384974, runt=888042msec
    slat (usec): min=1, max=517, avg= 2.84, stdev= 2.42
    clat (usec): min=47, max=102999, avg=323.36, stdev=812.22
     lat (usec): min=66, max=103005, avg=326.30, stdev=812.28
    clat percentiles (usec):
     |  1.00th=[  157],  5.00th=[  189], 10.00th=[  213], 20.00th=[  243],
     | 30.00th=[  255], 40.00th=[  266], 50.00th=[  278], 60.00th=[  306],
     | 70.00th=[  338], 80.00th=[  362], 90.00th=[  442], 95.00th=[  540],
     | 99.00th=[  884], 99.50th=[ 1032], 99.90th=[ 1400], 99.95th=[ 1576],
     | 99.99th=[ 2192]
    bw (KB  /s): min=110528, max=755808, per=25.42%, avg=391384.86, stdev=70104.19
    lat (usec) : 50=0.01%, 100=0.01%, 250=25.10%, 500=68.18%, 750=4.89%
    lat (usec) : 1000=1.24%
    lat (msec) : 2=0.56%, 4=0.01%, 10=0.01%, 20=0.01%, 100=0.01%
    lat (msec) : 250=0.01%
  cpu          : usr=15.28%, sys=33.70%, ctx=41972415, majf=0, minf=8095
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=341873784/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=333861MB, aggrb=1205.6MB/s, minb=1205.6MB/s, maxb=1205.6MB/s, mint=276937msec, maxt=276937msec

Run status group 1 (all jobs):
  WRITE: io=1304.2GB, aggrb=587137KB/s, minb=587137KB/s, maxb=587137KB/s, mint=2329089msec, maxt=2329089msec

Run status group 2 (all jobs):
   READ: io=1304.2GB, aggrb=1503.9MB/s, minb=1503.9MB/s, maxb=1503.9MB/s, mint=888042msec, maxt=888042msec

Disk stats (read/write):
  rssdb: ios=341902584/342541506, merge=0/0, ticks=102006501/301562189, in_queue=412651242, util=100.00%